# -*- coding: utf-8 -*-
"""
Created on Fri Aug 29 09:49:39 2025

@author: USER
"""

# Python 運算子的優先順序大致可分為：括號與次方 () > 單元運算子（如正負號、位元運算） > 乘、除、取模(%)、整除(//) > 加、減 > 位元移位 > 比較運算子 > 邏輯運算子（not、and、or） > 賦值運算子。 在執行多個運算時，會依照此順序進行計算，相同優先順序的運算則由左至右執行。 
# 詳細運算子優先順序（由高至低）

# 括號與次方:
# 括號 ()：優先處理括號內的運算。 
# 次方 **：接著計算指數運算。 

# 單元運算子:
    # 按位取反 ~。 
    # 正號 +、負號 -。 
    # 乘、除、取模、整除:
    # 乘法 *。 
    # 除法 /。 
    # 取模 %。 
    # 整除 //。 


# 注意：: 這些運算子具有相同優先順序，將從左到右執行。 
    # 加、減:
    # 加法 +。 
    # 減法 -。
    
    
# 注意：: 這兩個運算子也具有相同優先順序，將從左到右執行。 
    # 位元移位:
    # 左移 <<。 
    # 右移 >>。
    
    
# 比較運算子:
# 比較運算符，如小於等於 <=, 小於 <, 大於 >, 大於等於 >=, 不等於 !=, 等於 ==。 
# 邏輯運算子:
    # is 和 is not。 
    # in 和 not in。 
    # 邏輯非 not。 
    # 邏輯且 and。 
    # 邏輯或 or。 
    
# 注意：: 邏輯運算子的優先順序為 not > and > or。 
# 賦值運算子:
# = 和其他賦值運算符，如 +=, -=, *=, /=, %=, **=, <<=, >>=。 